improve diagram
